convergenceStudy/2/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

	maxNonOrtho 75;
	maxBoundarySkewness 15;
	maxInternalSkewness 4;
	maxConcave 80;
	minVol 1e-13;
	minTetQuality -1e+30;
	minArea -1;
	minTwist 0.05;
	minDeterminant 0.005;
	minFaceWeight 0.05;
	minVolRatio 0.01;
	minTriangleTwist -1;
	nSmoothScale   4;
	errorReduction 0.75;
	relaxed
	    {
	        minDeterminant 0.001;
		maxNonOrtho 80;
	    }


// ************************************************************************* //
